# Read Write Data From Databases

In [30]:
import pandas as pd
from sqlalchemy import create_engine

# Make sure your MySQL server is running and the database/table exist
engine = create_engine("mysql+pymysql://root:8830042305%40aA@localhost:3306/dbms")

# Read from the table
df = pd.read_sql_table("customers", engine )
print(df)

   id     name  phone_number
0   1   Donald           883
1   2     Bill           797
2   3     Modi           973

In [32]:
df = pd.read_sql_table("customers", engine ,columns = ["name" , "phone_number"])
df

      name  phone_number
0   Donald           883
1     Bill           797
2     Modi           973

In [34]:
df['name']

0     Donald
1       Bill
2       Modi
Name: name, dtype: object

In [36]:
query = '''
select customers.name , customers.phone_number , orders.name , orders.amount
from customers
inner join orders
on customers.id = orders.customer_id;
'''

df = pd.read_sql_query(query , engine)
df

      name  phone_number          name  amount
0     Bill           797      Yoga mat      20
1   Donald           883  Google pixel     950
2     Modi           973  Fossil Watch     120

In [39]:
df = pd.read_excel("C:\\Users\\Vinsc\\OneDrive\\Desktop\\Pandas\\sql_lecture10_pandas.xlsx")
df

  customer name  customer phone
0         rafel             789
1           kim             423
2          kunn            3421
3           sam             112
4         rahan             331
5         daksh             411
6        sohail             315

In [41]:
df.rename(columns = {
    'customer name' : 'name' ,
    'customer phone' : 'phone_number'
    
} , inplace = True)
df

     name  phone_number
0   rafel           789
1     kim           423
2    kunn          3421
3     sam           112
4   rahan           331
5   daksh           411
6  sohail           315

In [43]:
df.to_sql(
    name = 'customers',
    con = engine,
    index = False,
    if_exists = 'append'
)

7